class DialogueResponce:
    answ_help = \
    '''
    Я продаю билеты в заповедник в Сочи. Я учусь общаться связно, 
    но лучше всего понимаю прямые вопросы:

    "купить"
    "почем билеты" или "цена"
    "отмена"
    "что для этого нужно"

    Буду рад, если смогу помочь!
    '''

    answ_unknown = \
    '''
    К сожалению, мне не удалось разобрать запрос и помочь.
    
    Может, попробовать снова?
    
    Список доступных команд можно получить по слову "помощь" или "?"
    '''

    answ_cancel = \
    '''
    Мы отменили операцию и очистили данные. 
    Можно начать с чистого листа или завершить общение.
    '''

    answ_hello = \
    '''
    Доброе время суток! 

    Я могу помочь купить билеты в Сочинский заповедник 
    без очередей и получить QR-код, 
    который можно сохранить на устройстве или распечатать.

    Для покупки можно ввести "купить".

    Список доступных команд можно получить по слову "помощь" или "?"
    '''

    answ_start_selling = \
    '''
    Здорово! Для оформления билета мне понадобятся некоторые Ваши персональные данные.

    Они нигде не хранятся и сразу же при получении шифруются. 

    Если не согласны -- введите "отмена" или закройте меня. 

    Если всё в порядке -- введите ФИО. Следом нужны будут номер паспорта и даты
    поездки, и я смогу заказать для Вас билет.
    '''

    answ_ask_passport = \
    '''
    Нужны серия и номер паспорта, без пробелов
    Если вдруг удобно -- можно и с ними.
    '''

    answ_ask_start_date = \
    '''
    Когда поездка начнётся?
    
    (дд.ММ.гггг) -- (напримерю, 01.08.1893)
    '''

    answ_ask_end_date = \
    '''
    Когда закончится?
    
    (дд.ММ.гггг) -- ((например 03.09.1898)
    '''

    answ_ask_for_payment = \
    '''
    Отлично, большое спасибо! Пожалуйста, перейдите по ссылке для оплаты
    '''

    answ_farewell = \
    '''
    Пожалуйста, сохраните QR-код до конца вашего прибывание в заповеднике.
    Свяжитесь с нами по .... на случай, если что-то пошло не так, а я не
    смог с этим справиться.
    
    Спасибо и приятного отдыха!
    '''
